Repository: Antolius/switchboard-plug-security-privacy
Catalog: po/*.po
Languages: ug

source: Security & Privacy
ug: بىخەتەرلىك ۋە مەخپىيەتلىك

source: Configure firewall, screen lock, and activity information
ug: قوغداش تېمى تەڭشىكى، ئىكران قۇلۇپى ۋە ئىشلىتىش خاتىرىسى

source: Some settings require administrator rights to be changed
ug: بەزى تەڭشەكلەرنى باشقۇرغۇچىلىق سالاھىيىتى بولغاندىلا ئۆزگەرتكىلى بولىدۇ

source: Privacy
ug: مەخپىيەتلىك

source: Locking
ug: قۇلۇپلاش

source: Firewall
ug: قوغداش تېمى

source: Privacy Mode
ug: شەخسىي ھالەت

source: This operating system can gather useful statistics about file and app usage to provide extra functionality. If other people can see or access your account, you may wish to limit which items are recorded.
ug: بەزى ئىقتىدارلار ئۈچۈن بۇ مەشغۇلات سىستىمىسى ھۆججەت ۋە ئەپلەرنىڭ ئىشلىتىلىشىگە ئائىت بەزى ئۇچۇرلارنى يىغىدۇ.ئەگەر باشقا كىشىلەرمۇ كۆرەلىسە ياكى ھىساۋاتىڭىزنى زىيارەت قىلالىسا، ئۇ ھالدا خاتىرىلەنگەن مەزمۇنغا بەزى چەكلىمىلەرنى قويۇشىڭىزنى تەۋسىيە قىلىمىز.

source: The additional functionality that this data provides will be affected.
ug: بۇ ئۇچۇرلارنى ئىشلىتىدىغان ئىقتىدارلار تەسىرگە ئۇچرايدۇ.

source: This will not prevent apps from recording their own usage data like browser history.
ug: بۇ توركۆرگۈچ تارىخىغا ئوخشاش ئەپلەرنىڭ ئۆزىنىڭ ئىشلىتىلىشىگە ئوخشاش ئۇچۇرلارنى يىغىشىغا تەسىر يەتكۈزمەيدۇ.

source: Your system
ug: سىستىمىڭىز

source: Lock on sleep:
ug: ئۇخلاش ھالىتىگە كىرگەندە قۇلۇپلاش:

source: Lock after screen turns off:
ug: ئىكران ئۆچكەندىن كىيىن قۇلۇپلاش:

source: Unknown
ug: نامەلۇم

source: Allow
ug: يول قويۇش

source: Deny
ug: چەكلەش

source: Reject
ug: رەت قىلىش

source: Limit
ug: چەك قويۇش

source: In
ug: ئۇچۇرنى كىرگۈزۈش

source: Out
ug: ئۇچۇرنى چىقىرىش

source: Action
ug: ھەركەت

source: Protocol
ug: كىلىشىم

source: Direction
ug: يۆنىلىش

source: Action:
ug: ھەركەت:

source: Protocol:
ug: كىلىشىم:

source: Direction:
ug: يۆنىلىش:

source: Ports:
ug: پورتلار:

source: %d or %d-%d
ug: %d ياكى %d-%d

source: Add Rule
ug: قائىدە قىتىش

source: Data Sources:
ug: ئۇچۇر مەنبەسى:

source: Chat Logs
ug: پاراڭلىشىش خاتىرىسى:

source: Documents
ug: يازما ھۆججەتلەر

source: Music
ug: مۇزىكىلار

source: Pictures
ug: رەسىملەر

source: Presentations
ug: كۆرسىتىش ھۆججەتلىرى

source: Spreadsheets
ug: جەدىۋەللەر

source: Videos
ug: ۋېدىئولار

source: Search Application
ug: ئەپ ئىزدەش

source: Add Application…
ug: ئەپ قىتىش....

source: Add Folder…
ug: مۇندەرىجە قىتىش....

source: Select a folder to blacklist
ug: قارا تىزىملىككە كىرگۈزىدىغان مۇندەرىجىنى تاللاڭ

source: Cancel
ug: ئەمەلدىن قالدۇرۇش

source: Add
ug: قىتىش

source: Delete
ug: ئۆچۈرۈش

source: Do not collect data from the following:
ug: تۆۋەندىكى تۈرلەردىن ئۇچۇر يىغماسلىق:

source: Remove system-collected file and application usage data from:
ug: سىستىما يىغقان ھۆججەت ۋە ئەپلەرنىڭ ئىشلىتىلىشىگە دائىر ئۇچۇرلارنى ئۆچۈرۈش:

source: The past hour
ug: ئالدىنقى بىر سائەت

source: The past day
ug: ئالدىنقى بىركۈن

source: The past week
ug: ئالدىنقى بىر ھەپتە

source: From:
ug: باشلىنىش چىسلاسى:

source: All time
ug: بارلىق مەزمۇنلار

source: To:
ug: ئاخىرلىشىش چىسلاسى:

source: Clear Data
ug: ئۇچۇرلارنى ئۆچۈرۈش

source: Authentication is required to run the Firewall Configuration
ug: قوغداش تېمىنى تەڭشەش ئۈچۈن سالاھىيەت دەلىللەش زۆرۈر
